app/Controllers/Products.php

    public function index()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();
---
SELECT *
FROM `products`

    public function store()
    {
        $model = new ProductModel();
        $data = [
            'name' => $this->request->getPost('name'),
            'description' => $this->request->getPost('description'),
            'price' => $this->request->getPost('price')
        ];
        $model->insert($data);
---
INSERT INTO `products` (`name`, `description`, `price`) VALUES ('Item 4', 'The standard chunk of Lorem Ipsum used since the 1500s is reproduced below for those interested.', '340.00')

    public function edit($id)
    {
        $model = new ProductModel();
        $data['product'] = $model->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'

    public function delete($id)
    {
        $model = new ProductModel();
        $model->delete($id);
---
DELETE FROM `products`
WHERE `id` IN ('1')